Revit 2027 API
ParameterTypeId.AnalyticalThermalResistance Property
 "Thermal Resistance (R)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalThermalResistance { get; }
Public Shared ReadOnly Property AnalyticalThermalResistance As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalThermalResistance {
	ForgeTypeId^ get ();
}
static member AnalyticalThermalResistance : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace